{
    "basic": {
        "gameId": "GOG",
        "enabled": true,
        "visible": true,
        "maintenance": null,
        "shortName": "Game Over Gopher",
        "longName": "Game Over Gopher",
        "grades": "2 - 7",
        "subject": "Math",
        "type": "Browser",
        "platform": {
            "type": "Browser/Flash",
            "icon": {
                "small": "assets/platform-browser.png",
                "large": "assets/platform-browser@2x.png"
            }
        },
        "price": "Premium",
        "release": "live",
        "releaseDate": "Dec 21, 2014",
        "shortDescription": "PLACEHOLDER SHORT DESCRIPTION",
        "description": "Game Over Gopher is an exciting tower defense game built around the coordinate grid. To defend a prize carrot, the player selects various tools to “feed” the space gophers marching hungrily toward it. Game Over Gopher guides students in plotting.",
        "developer": {
            "id": "MS",
            "name": "Math Snacks",
            "logo": {
                "small": "assets/dev-logo-mathsnacks.png",
                "large": "assets/dev-logo-mathsnacks@2x.png"
            },
            "description": "Funded by the National Science Foundation, Math Snacks is a suite of interactive educational learning modules including games, animations, apps, and supplementary teacher/learner materials.<br /><br />Regardless of socio-economic status, grade level, type of school, or education level of parents, research shows students consistently struggle with the same content in mathematics learning. Facilitating math and science learning for youth is a social and economic justice issue. Without solid math skills, many fields of study, including science, are inaccessible. This affects minorities and low-income populations disproportionately. Math education is cumulative, in that each grade builds on concepts taught in the previous grades. Gaps in math knowledge in 6th grade learners profoundly influence their performance in high school and college.<br /><br />Math Snacks focuses on developing educational media to help students grasp frequently misunderstood core mathematics concepts that constrain their math achievement as early as middle school and impact lifelong career choices and achievement. Mathematics educators, mathematicians, learning specialists and game developers collaborated to develop games and media tools that are easy to access and use. Although each module is a small \"mathematical snack\" in itself, together they provide rich nourishment for the middle school curriculum."
        },
        "settings": {
            "canCreateMatches": false
        },
        "license": {
            "type": "loginType",
            "loginType": "glasslabv2,icivics,edmodo",
            "valid": false,
            "message": {
                "invalid": "Coming Soon!"
            }
        },
        "thumbnail": {
            "small": "assets/thumb-game-GOG.png",
            "large": "assets/thumb-game-GOG@2x.png"
        },
        "card": {
            "small": "assets/game-card-GOG.png",
            "large": "assets/game-card-GOG@2x.png"
        },
        "banners": {
            "product": "assets/game-banner-GOG.png",
            "reports": "assets/game-banner-GOG.png"
        },
        "play": {
            "type": "page",
            "page": {
                "title": "Game Over Gopher",
                "embed": "https://s3-us-west-1.amazonaws.com/playfully-games/GOG/game/151/gog.swf",
                "format": "swf",
                "size": {
                    "width": 800,
                    "height": 600
                }
            }
        }
    },
    "assessment": [
        {
            "enabled": true,
            "id": "sowo",
            "dataProcessScope": "all",
            "engine": "javascript",
            "trigger": "endSession",
            "rules": {
                "wo1": {
                    "name": "Struggling with Level",
                    "description": "This student has failed a level at least 3 times, and may be struggling to understand basic gameplay mechanics."
                },
                "wo2": {
                    "name": "No Corn Silos",
                    "description": "Player has not used the Corn Silo tool, and may be having trouble manipulating x and y coordinates to choose a location on the path."
                },
                "wo3": {
                    "name": "No Iceberg Lettuce",
                    "description": "Player has not used the Iceberg Lettuce tool, and may not be able to locate the origin (0,0)."
                },
                "wo4": {
                    "name": "No Melon Strike",
                    "description": "Player has not used the Melon Strike tool, and may not understand quadrant names."
                },
                "wo5": {
                    "name": "No Wheatgrass Blaster",
                    "description": "Player has not used the Wheatgrass Blaster tool, and may not understand how to create a vertical or horizontal line using x or y coordinates."
                },
                "wo6": {
                    "name": "Struggling with Challenge Round",
                    "description": "Player may not understand how to predict points on a graph, and have struggled with a challenge level."
                },
                "so1": {
                    "name": "Challenge Round Skill",
                    "description": "The player has successfully solved a challenge round in fewer than 5 guesses."
                },
                "so2": {
                    "name": "Tool Expert",
                    "description": "Player has successfully used every tool in Game Over Gopher."
                },
                "so3": {
                    "name": "Challenge Round Expert",
                    "description": "Player has completed all challenge rounds."
                },
                "so4": {
                    "name": "Game Over Gopher Expert",
                    "description": "Player has completed all 14 levels."
                }
            }
        }
    ],
    "reports": {
        "list": [
            {
                "id": "achievements",
                "assessmentId": "none",
                "enabled": true,
                "name": "Learning Events & Time Played",
                "header": {
                    "text": "Learning Events & Time Played",
                    "image": "assets/game-banner-GOG.png",
                    "skinny": "assets/skinny-banner-GOG.png",
                    "large": "assets/skinny-banner-GOG@2x.png"
                },
                "description": "In addition to showing total time played, this report reveals critical accomplishments in the game and how these accomplishments align to curriculum standards.",
                "achievements": "PLACEHOLDER will be AUTO REPLACED with contents of achievements.json"
            },
            {
                "id": "sowo",
                "assessmentId": "sowo",
                "enabled": true,
                "name": "Shout Out and Watch Out Report",
                "header": {
                    "text": "Shout Out and Watch Out Report",
                    "image": "assets/game-banner-GOG.png",
                    "skinny": "assets/skinny-banner-GOG.png",
                    "large": "assets/skinny-banner-GOG@2x.png"
                },
                "table": {
                    "labels": [],
                    "groups": [
                        {
                            "id": "so",
                            "title": "Shout Out!",
                            "headers": [
                                {
                                    "id": "so1",
                                    "title": "Challenge Round Skill",
                                    "description": "The player has successfully solved a challenge round in fewer than 5 guesses."
                                },
                                {
                                    "id": "so2",
                                    "title": "Tool Expert",
                                    "description": "Player has successfully used every tool in Game Over Gopher."
                                },
                                {
                                    "id": "so3",
                                    "title": "Challenge Round Expert",
                                    "description": "Player has completed all challenge rounds."
                                },
                                {
                                    "id": "so4",
                                    "title": "Game Over Gopher Expert",
                                    "description": "Player has completed all 14 levels."
                                }
                            ]
                        },
                        {
                            "id": "wo",
                            "title": "Watch Out!",
                            "headers": [
                                {
                                    "id": "wo1",
                                    "title": "Struggling with Level",
                                    "description": "This student has failed a level at least 3 times, and may be struggling to understand basic gameplay mechanics."
                                },
                                {
                                    "id": "wo2",
                                    "title": "No Corn Silos",
                                    "description": "Player has not used the Corn Silo tool, and may be having trouble manipulating x and y coordinates to choose a location on the path."
                                },
                                {
                                    "id": "wo3",
                                    "title": "No Iceberg Lettuce",
                                    "description": "Player has not used the Iceberg Lettuce tool, and may not be able to locate the origin (0,0)."
                                },
                                {
                                    "id": "wo4",
                                    "title": "No Melon Strike",
                                    "description": "Player has not used the Melon Strike tool, and may not understand quadrant names."
                                },
                                {
                                    "id": "wo5",
                                    "title": "No Wheatgrass Blaster",
                                    "description": "Player has not used the Wheatgrass Blaster tool, and may not understand how to create a vertical or horizontal line using x or y coordinates."
                                },
                                {
                                    "id": "wo6",
                                    "title": "Struggling with Challenge Round",
                                    "description": "Player may not understand how to predict points on a graph, and have struggled with challenge level [n]."
                                }
                            ]
                        }
                    ]
                },
                "description": "This report provides a snapshot of how students are doing right now. Celebrate your students' success (Shout Out!) and intervene with those students in need of help (Watch Out!)."
            }
        ]
    },
    "details": {
        "buttons": [
            {
                "name": "Play Game",
                "type": "play",
                "authRequired": true,
                "links": [
                    {
                        "name": "Play Game",
                        "type": "play"
                    }
                ]
            }
        ],
        "pages": {
            "product": {
                "order": 1,
                "enabled": true,
                "id": "product",
                "title": "Product Description",
                "header": "About the Game",
                "about": "Game Over Gopher is an exciting tower defense game built around the coordinate grid. To defend a prize carrot, the player selects various tools to \"feed\" the space gophers marching hungrily toward it. Game Over Gopher guides students in plotting coordinate pairs, differentiating negative coordinates from positive coordinates, and identifying the four quadrants. It helps establish the fundamentals of plotting functions on a grid. We recommend it for students who are struggling to understand the coordinate grid or those who just want to become more comfortable with graphing.<br ><br >Funded by the National Science Foundation and developed by the Learning Games Lab at New Mexico State University, Game Over Gopher is a game in the Math Snacks suite of interactive educational learning modules, and prepares students to better understand mathematics concepts crucial for 6th-grade math. Aligned to Common Core standards, it has been used effectively with students in 2nd through 7th grades learning to graph coordinates and track locations on a grid.",
                "video": "https://www.youtube.com/embed/3AWu9Ln7s6E",
                "brochure": "",
                "curriculum": [
                    "Addresses Common Core standards related to application of coordinates, ordered pairs, and absolute value to solving real-world and mathematical problems",
                    "Offers interactive modules and short animations intended to creatively and visually help learners better understand the concepts behind difficult mathematics concepts"
                ],
                "slideshow": [
                    {
                        "type": "image",
                        "url": "assets/GOG-carousel_1.png"
                    },
                    {
                        "type": "image",
                        "url": "assets/GOG-carousel_2.png"
                    },
                    {
                        "type": "image",
                        "url": "assets/GOG-carousel_3.png"
                    }
                ]
            },
            "standards": {
                "order": 2,
                "enabled": true,
                "authRequired": false,
                "id": "standards",
                "title": "Standards",
                "CCSS": [
                    {
                        "category": "Common Core Math",
                        "groups": [
                            {
                                "list": [
                                    {
                                        "name": "CCSS.Math.Content.6.G.A.3",
                                        "link": "http://www.corestandards.org/Math/Content/6/G/A/3/",
                                        "description": "Draw polygons in the coordinate plane given coordinates for the vertices; use coordinates to find the length of a side joining points with the same first coordinate or the same second coordinate. Apply these techniques in the context of solving real-world and mathematical problems."
                                    },
                                    {
                                        "name": "CCSS.Math.Content.6.NS.C.6.b",
                                        "link": "http://www.corestandards.org/Math/Content/6/NS/C/6/b/",
                                        "description": "Understand signs of numbers in ordered pairs as indicating locations in quadrants of the coordinate plane; recognize that when two ordered pairs differ only by signs, the locations of the points are related by reflections across one or both axes."
                                    },
                                    {
                                        "name": "CCSS.Math.Content.6.NS.C.6.c",
                                        "link": "http://www.corestandards.org/Math/Content/6/NS/C/6/c/",
                                        "description": "Find and position integers and other rational numbers on a horizontal or vertical number line diagram; find and position pairs of integers and other rational numbers on a coordinate plane."
                                    },
                                    {
                                        "name": "CCSS.Math.Content.6.NS.C.8",
                                        "link": "http://www.corestandards.org/Math/Content/6/NS/C/8/",
                                        "description": "Solve real-world and mathematical problems by graphing points in all four quadrants of the coordinate plane. Include use of coordinates and absolute value to find distances between points with the same first coordinate or the same second coordinate."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            "lessonPlans": {
                "order": 3,
                "enabled": true,
                "authRequired": true,
                "id": "lessonPlans",
                "title": "Lesson Plans & Videos",
                "list": [
                    {
                        "category": "Lesson Plans",
                        "list": [
                            {
                                "name": "Here are some simple strategies for using Math Snacks games in your classroom:",
                                "link": "",
                                "description": ""
                            },
                            {
                                "name": "",
                                "link": "",
                                "description": "We know you may not have time to play the game all the way through. Play through at least the first level, and watch the Gameplay video for each one, to get an understanding of what changes from level to level."
                            },
                            {
                                "name": "",
                                "link": "",
                                "description": "Watch the Teaching video for each game. Each is shorter than 10 minutes, and gives really important strategies for teaching with the game, and engaging students in follow up activities to help them apply what they've learned."
                            },
                            {
                                "name": "",
                                "link": "",
                                "description": "Secure lab time and secure the proper number of computers or iPads for students. All games and animations are available online. Ratio Rumble, and Pearl Diver are also on the iPad. Most games will take 2-3 hours for students to play."
                            },
                            {
                                "name": "",
                                "link": "",
                                "description": "Games can be played in different ways: students can play individually, in pairs, in small groups or in one large group using a Smartboard, depending on the technology available in your classroom or computer lab."
                            },
                            {
                                "name": "",
                                "link": "",
                                "description": "Don't be afraid to let the game teach. Math Snacks games aren’t designed to measure what your students already know, but to give students the chance go understand concepts. They won’t succeed at every level their first time playing, and they aren't supposed to. Let your students make mistakes, talk with each other, create strategies and learn from those mistakes."
                            },
                            {
                                "name": "Game Over Gopher Teacher Guide",
                                "link": "http://mathsnacks.com/media/print/gameovergopher_teachingwith.pdf"
                            }
                        ]
                    },
                    {
                        "category": "Videos",
                        "list": [
                            {
                                "name": "Teaching with Game Over Gopher",
                                "link": "https://www.youtube.com/embed/3AWu9Ln7s6E"
                            },
                            {
                                "name": "Game Over Gopher Gameplay",
                                "link": "https://www.youtube.com/watch?feature=player_embedded&v=LL0yO5_2CUo"
                            }
                        ]
                    }
                ]
            },
            "research": {
                "order": 4,
                "enabled": true,
                "authRequired": true,
                "id": "research",
                "title": "Research",
                "list": [
                    {
                        "category": "Research Articles",
                        "list": [
                            {
                                "name": "Bridging research and game development: A Learning Games Design Model for multi-game projects",
                                "link": "https://books.google.com/books?id=-RaXBQAAQBAJ&pg=PA151&dq=bridging+research+and+game+development&hl=en&sa=X&ei=w92RVPX3FcTwoATXwYG4CA&ved=0CCgQ6AEwAA#v=onepage&q=bridging%20research%20and%20game%20development&f=false"
                            },
                            {
                                "name": "The role of animations and manipulatives in supporting learning and communication in Mathematics classrooms",
                                "link": "http://www.irma-international.org/viewtitle/74216/"
                            },
                            {
                                "name": "Math Snacks: Using animations and games to fill the gaps in mathematics",
                                "link": "http://www.sciedu.ca/journal/index.php/jct/article/view/3389/2165"
                            },
                            {
                                "name": "Teachers learn how to effectively integrate mobile technology by teaching students using Math Snacks animations and games",
                                "link": "http://www.igi-global.com/chapter/teachers-learn-effectively-integrate-mobile/74907"
                            },
                            {
                                "name": "The learning games design model: Immersion, collaboration, and outcomes-driven development",
                                "link": ""
                            },
                            {
                                "name": "21st Century learning: The role of serious games",
                                "link": "http://www.igi-global.com/chapter/21st-century-learning/64285"
                            },
                            {
                                "name": "Collaboration, engagement & fun: How youth preferences in video gaming can inform 21st Century education",
                                "link": "http://link.springer.com/article/10.1007%2Fs11528-011-0541-5#page-1"
                            }
                        ]
                    }
                ]
            },
            "reviews": {
                "order": 5,
                "enabled": false,
                "id": "reviews",
                "title": "Reviews",
                "list": [
                    {
                        "reviewer": "PLACEHOLDER REVIEWER",
                        "review": "PLACEHOLDER REVIEW"
                    }
                ]
            }
        },
        "social": {
            "facebook": "https://www.facebook.com/mathsnacks",
            "twitter": "https://twitter.com/MathSnacks",
            "google": "https://plus.google.com/u/0/102525410497723065627/about"
        }
    }
}
