{
    "groups": [
        {
            "id": "a",
            "description": "Common Core Standards",
            "title": "Standards",
            "subGroups": [
                {
                    "id": "a",
                    "title": "CCSS Math 2.OA.A.1",
                    "name": "",
                    "description": "Use addition and subtraction within 100 to solve one- and two-step word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem.",
                    "info": ""
                },
                {
                    "id": "b",
                    "title": "CCSS Math 4.OA.C.5",
                    "name": "",
                    "description": "Generate a number or shape pattern that follows a given rule. Identify apparent features of the pattern that were not explicit in the rule itself. For example, given the rule \"Add 3\" and the starting number 1, generate terms in the resulting sequence and observe that the terms appear to alternate between odd and even numbers. Explain informally why the numbers will continue to alternate in this way.",
                    "info": ""
                },
                {
                    "id": "c",
                    "title": "CCSS Math 5.OA.B.3",
                    "name": "",
                    "description": "Generate two numerical patterns using two given rules. Identify apparent relationships between corresponding terms. Form ordered pairs consisting of corresponding terms from the two patterns, and graph the ordered pairs on a coordinate plane. For example, given the rule \"Add 3\" and the starting number 0, and given the rule \"Add 6\" and the starting number 0, generate terms in the resulting sequences, and observe that the terms in one sequence are twice the corresponding terms in the other sequence. Explain informally why this is so.",
                    "info": ""
                },
                {
                    "id": "d",
                    "title": "CCSS Math 6.NS.C.5",
                    "name": "",
                    "description": "Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above/below zero, elevation above/below sea level, credits/debits, positive/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation.",
                    "info": ""
                },
                {
                    "id": "e",
                    "title": "CCSS Math 6.NS.C.6",
                    "name": "",
                    "description": "Understand a rational number as a point on the number line. Extend number line diagrams and coordinate axes familiar from previous grades to represent points on the line and in the plane with negative number coordinates.",
                    "info": ""
                },
                {
                    "id": "f",
                    "title": "CCSS Math 2.NBT.A.2",
                    "name": "",
                    "description": "Count within 1000; skip-count by 5s, 10s, and 100s.",
                    "info": ""
                },
                {
                    "id": "g",
                    "title": "CCSS Math 2.OA.A.2",
                    "name": "",
                    "description": "",
                    "info": ""
                },
                {
                    "id": "h",
                    "title": "CCSS Math 2.OA.B.2",
                    "name": "",
                    "description": "Fluently add and subtract within 20 using mental strategies. By end of Grade 2, know from memory all sums of two one-digit numbers.",
                    "info": ""
                },
                {
                    "id": "i",
                    "title": "CCSS Math 3.OA.A.1",
                    "name": "",
                    "description": "Interpret products of whole numbers, e.g., interpret 5 × 7 as the total number of objects in 5 groups of 7 objects each. For example, describe a context in which a total number of objects can be expressed as 5 × 7.",
                    "info": ""
                },
                {
                    "id": "j",
                    "title": "CCSS Math 3.OA.A.4",
                    "name": "",
                    "description": "Determine the unknown whole number in a multiplication or division equation relating three whole numbers. For example, determine the unknown number that makes the equation true in each of the equations 8 × ? = 48, 5 = _ ÷ 3, 6 × 6 = ?",
                    "info": ""
                },
                {
                    "id": "k",
                    "title": "CCSS Math 3.OA.D.9",
                    "name": "",
                    "description": "Identify arithmetic patterns (including patterns in the addition table or multiplication table), and explain them using properties of operations. For example, observe that 4 times a number is always even, and explain why 4 times a number can be decomposed into two equal addends.",
                    "info": ""
                },
                {
                    "id": "l",
                    "title": "CCSS Math 3.NBT.A.2",
                    "name": "",
                    "description": "Fluently add and subtract within 1000 using strategies and algorithms based on place value, properties of operations, and/or the relationship between addition and subtraction.",
                    "info": ""
                }
            ]
        }
    ],
    "achievements": [
        {
            "id": "WT_ach_1_aa",
            "title": "Beginning basic skills",
            "info": "The student shows beginning development of basic integer addition and multiplication skills.",
            "standards": [
                {
                    "group": "a",
                    "subGroup": "a"
                },
                {
                    "group": "a",
                    "subGroup": "f"
                }
            ]
        },
        {
            "id": "WT_ach_2_ab",
            "title": "Basic skills secure",
            "info": "The student shows competency in basic integer addition and multiplication skills.",
            "standards": [
                {
                    "group": "a",
                    "subGroup": "b"
                },
                {
                    "group": "a",
                    "subGroup": "f"
                },
                {
                    "group": "a",
                    "subGroup": "g"
                },
                {
                    "group": "a",
                    "subGroup": "h"
                },
                {
                    "group": "a",
                    "subGroup": "i"
                }
            ]
        },
        {
            "id": "WT_ach_3_ac",
            "title": "Arithmetic fluency",
            "info": "The student shows arithmetic fluency with regards to addition and multiplication.",
            "standards": [
                {
                    "group": "a",
                    "subGroup": "b"
                },
                {
                    "group": "a",
                    "subGroup": "c"
                },
                {
                    "group": "a",
                    "subGroup": "i"
                },
                {
                    "group": "a",
                    "subGroup": "j"
                },
                {
                    "group": "a",
                    "subGroup": "k"
                }
            ]
        },
        {
            "id": "WT_ach_4_ad",
            "title": "Problem solver",
            "info": "The student exihibts good problem solving skills involving algebraic and algorithmic reasoning.",
            "standards": [
                {
                    "group": "a",
                    "subGroup": "b"
                },
                {
                    "group": "a",
                    "subGroup": "c"
                },
                {
                    "group": "a",
                    "subGroup": "d"
                },
                {
                    "group": "a",
                    "subGroup": "e"
                },
                {
                    "group": "a",
                    "subGroup": "j"
                },
                {
                    "group": "a",
                    "subGroup": "k"
                },
                {
                    "group": "a",
                    "subGroup": "l"
                }
            ]
        },
        {
            "id": "WT_ach_5_ae",
            "title": "Mathematical promise",
            "info": "The student exhibits mathematical promise that should be encouraged and further developed.",
            "standards": [
                {
                    "group": "a",
                    "subGroup": "b"
                },
                {
                    "group": "a",
                    "subGroup": "c"
                },
                {
                    "group": "a",
                    "subGroup": "d"
                },
                {
                    "group": "a",
                    "subGroup": "e"
                },
                {
                    "group": "a",
                    "subGroup": "k"
                },
                {
                    "group": "a",
                    "subGroup": "l"
                }
            ]
        },
        {
            "id": "WT_ach_6_ae",
            "title": "Mathematical talent",
            "info": "The student exhibits mathematical talent that should be encouraged and further developed.",
            "standards": [
                {
                    "group": "a",
                    "subGroup": "b"
                },
                {
                    "group": "a",
                    "subGroup": "c"
                },
                {
                    "group": "a",
                    "subGroup": "d"
                },
                {
                    "group": "a",
                    "subGroup": "e"
                },
                {
                    "group": "a",
                    "subGroup": "k"
                },
                {
                    "group": "a",
                    "subGroup": "l"
                }
            ]
        }
    ]
}